Revit 2026 API

# InstanceGetTotalTransform Method

---

Gets the total transform, which includes the true north transform for instances like import instances.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform GetTotalTransform()
```
```vb
Public Function GetTotalTransform As Transform
```
```cpp
public:
Transform^ GetTotalTransform()
```
```fsharp
member GetTotalTransform : unit -> Transform
```

#### Return Value

Transform The calculated total transform.

For most of other instances, it simply returns the inherent transform.

#### Reference

Instance Class

Autodesk.Revit.DB Namespace